espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG14P/Include/efr32fg14p232f128gm48.h
/** Flash and SRAM limits for EFR32FG14P232F128GM48 */
#define FLASH_BASE                 (0x00000000UL) /**< Flash Base Address */
#define FLASH_SIZE                 (0x00020000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE            2048U          /**< Flash Memory page size */
#define SRAM_BASE                  (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE                  (0x00004000UL) /**< Available SRAM Memory */
#define __CM4_REV                  0x0001U        /**< Cortex-M4 Core revision r0p1 */
#define PRS_CHAN_COUNT             12             /**< Number of PRS channels */
#define DMA_CHAN_COUNT             8              /**< Number of DMA channels */
#define EXT_IRQ_COUNT              42             /**< Number of External (NVIC) interrupts */

/** AF channels connect the different on-chip peripherals with the af-mux */
#define AFCHAN_MAX                 105U
/** AF channel maximum location number */
#define AFCHANLOC_MAX              32U
/** Analog AF channels */
#define AFACHAN_MAX                98U

/* Part number capabilities */

#define CRYPTO_PRESENT          /**< CRYPTO is available in this part */
#define CRYPTO_COUNT          1 /**< 1 CRYPTOs available  */
#define TIMER_PRESENT           /**< TIMER is available in this part */
#define TIMER_COUNT           2 /**< 2 TIMERs available  */
#define WTIMER_PRESENT          /**< WTIMER is available in this part */
#define WTIMER_COUNT          1 /**< 1 WTIMERs available  */
#define USART_PRESENT           /**< USART is available in this part */
#define USART_COUNT           2 /**< 2 USARTs available  */
#define LEUART_PRESENT          /**< LEUART is available in this part */
#define LEUART_COUNT          1 /**< 1 LEUARTs available  */
#define LETIMER_PRESENT         /**< LETIMER is available in this part */
#define LETIMER_COUNT         1 /**< 1 LETIMERs available  */
#define PCNT_PRESENT            /**< PCNT is available in this part */
#define PCNT_COUNT            1 /**< 1 PCNTs available  */
#define I2C_PRESENT             /**< I2C is available in this part */
#define I2C_COUNT             1 /**< 1 I2Cs available  */
#define ADC_PRESENT             /**< ADC is available in this part */
#define ADC_COUNT             1 /**< 1 ADCs available  */
#define ACMP_PRESENT            /**< ACMP is available in this part */
#define ACMP_COUNT            2 /**< 2 ACMPs available  */
#define VDAC_PRESENT            /**< VDAC is available in this part */
#define VDAC_COUNT            1 /**< 1 VDACs available  */
#define WDOG_PRESENT            /**< WDOG is available in this part */
#define WDOG_COUNT            2 /**< 2 WDOGs available  */
#define IDAC_PRESENT            /**< IDAC is available in this part */
#define IDAC_COUNT            1 /**< 1 IDACs available  */
#define TRNG_PRESENT            /**< TRNG is available in this part */
#define TRNG_COUNT            1 /**< 1 TRNGs available  */
#define MSC_PRESENT             /**< MSC is available in this part */
#define MSC_COUNT             1 /**< 1 MSC available */
#define EMU_PRESENT             /**< EMU is available in this part */
#define EMU_COUNT             1 /**< 1 EMU available */
#define RMU_PRESENT             /**< RMU is available in this part */
#define RMU_COUNT             1 /**< 1 RMU available */
#define CMU_PRESENT             /**< CMU is available in this part */
#define CMU_COUNT             1 /**< 1 CMU available */
#define GPIO_PRESENT            /**< GPIO is available in this part */
#define GPIO_COUNT            1 /**< 1 GPIO available */
#define PRS_PRESENT             /**< PRS is available in this part */
#define PRS_COUNT             1 /**< 1 PRS available */
#define LDMA_PRESENT            /**< LDMA is available in this part */
#define LDMA_COUNT            1 /**< 1 LDMA available */
#define FPUEH_PRESENT           /**< FPUEH is available in this part */
#define FPUEH_COUNT           1 /**< 1 FPUEH available */
#define GPCRC_PRESENT           /**< GPCRC is available in this part */
#define GPCRC_COUNT           1 /**< 1 GPCRC available */
#define CRYOTIMER_PRESENT       /**< CRYOTIMER is available in this part */
#define CRYOTIMER_COUNT       1 /**< 1 CRYOTIMER available */
#define LESENSE_PRESENT         /**< LESENSE is available in this part */
#define LESENSE_COUNT         1 /**< 1 LESENSE available */
#define RTCC_PRESENT            /**< RTCC is available in this part */
#define RTCC_COUNT            1 /**< 1 RTCC available */
#define PRORTC_PRESENT          /**< PRORTC is available in this part */
#define PRORTC_COUNT          1 /**< 1 PRORTC available */
#define BOOTLOADER_PRESENT      /**< BOOTLOADER is available in this part */
#define BOOTLOADER_COUNT      1 /**< 1 BOOTLOADER available */
#define SMU_PRESENT             /**< SMU is available in this part */
#define SMU_COUNT             1 /**< 1 SMU available */
#define DCDC_PRESENT            /**< DCDC is available in this part */
#define DCDC_COUNT            1 /**< 1 DCDC available */

#include "core_cm4.h"           /* Cortex-M4 processor and core peripherals */
#include "system_efr32fg14p.h"  /* System Header File */

/** @} End of group EFR32FG14P232F128GM48_Part */

/***************************************************************************//**
 * @defgroup EFR32FG14P232F128GM48_Peripheral_TypeDefs Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

#include "efr32fg14p_msc.h"
#include "efr32fg14p_emu.h"
#include "efr32fg14p_rmu.h"
#include "efr32fg14p_cmu.h"
#include "efr32fg14p_crypto.h"
#include "efr32fg14p_gpio_p.h"
#include "efr32fg14p_gpio.h"
#include "efr32fg14p_prs_ch.h"
#include "efr32fg14p_prs.h"
#include "efr32fg14p_ldma_ch.h"
#include "efr32fg14p_ldma.h"
#include "efr32fg14p_fpueh.h"
#include "efr32fg14p_gpcrc.h"
#include "efr32fg14p_timer_cc.h"
#include "efr32fg14p_timer.h"
#include "efr32fg14p_usart.h"
#include "efr32fg14p_leuart.h"
#include "efr32fg14p_letimer.h"
#include "efr32fg14p_cryotimer.h"
#include "efr32fg14p_pcnt.h"
#include "efr32fg14p_i2c.h"
#include "efr32fg14p_adc.h"
#include "efr32fg14p_acmp.h"
#include "efr32fg14p_vdac_opa.h"
#include "efr32fg14p_vdac.h"
#include "efr32fg14p_lesense_st.h"
#include "efr32fg14p_lesense_buf.h"
#include "efr32fg14p_lesense_ch.h"
#include "efr32fg14p_lesense.h"
#include "efr32fg14p_rtcc_cc.h"
#include "efr32fg14p_rtcc_ret.h"
#include "efr32fg14p_rtcc.h"
#include "efr32fg14p_rtc_comp.h"
#include "efr32fg14p_rtc.h"
#include "efr32fg14p_wdog_pch.h"
#include "efr32fg14p_wdog.h"
#include "efr32fg14p_idac.h"
#include "efr32fg14p_smu.h"
#include "efr32fg14p_trng.h"
#include "efr32fg14p_dma_descriptor.h"
#include "efr32fg14p_devinfo.h"
#include "efr32fg14p_romtable.h"

